{"class_name": "Sequential", "keras_version": "2.0.5", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "activation": "relu", "batch_input_shape": [null, 140, 100, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "strides": [1, 1], "data_format": "channels_last", "name": "conv2d_17", "filters": 32, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_17", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activity_regularizer": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_17", "units": 4, "kernel_regularizer": null, "trainable": true}}]}