{"backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "dtype": "float32", "activity_regularizer": null, "name": "conv2d_31", "bias_constraint": null, "filters": 32, "kernel_size": [8, 8], "data_format": "channels_last", "batch_input_shape": [null, 25, 35, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "name": "conv2d_32", "bias_constraint": null, "filters": 64, "kernel_size": [4, 4], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "valid", "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "name": "conv2d_33", "bias_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "valid", "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "strides": [1, 1]}}, {"class_name": "Flatten", "config": {"name": "flatten_11", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "dense_11", "bias_constraint": null, "units": 4, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "use_bias": true}}], "keras_version": "2.0.8", "class_name": "Sequential"}