{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "relu", "name": "conv2d_4", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "data_format": "channels_last", "batch_input_shape": [null, 25, 35, 1], "use_bias": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "padding": "valid", "filters": 32, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [8, 8]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "relu", "name": "conv2d_5", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "kernel_size": [4, 4]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "relu", "name": "conv2d_6", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "softmax", "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "units": 4, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}}], "backend": "tensorflow", "keras_version": "2.0.8"}