{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [8, 8], "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "activity_regularizer": null, "name": "conv2d_7", "batch_input_shape": [null, 25, 35, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "padding": "valid", "filters": 32, "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [4, 4], "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "activity_regularizer": null, "name": "conv2d_8", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "padding": "valid", "filters": 64}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "activity_regularizer": null, "name": "conv2d_9", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "padding": "valid", "filters": 64}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "name": "dense_3", "activation": "softmax", "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 4, "kernel_regularizer": null, "use_bias": true}}], "keras_version": "2.0.8"}